Please enter the password to unlock the Key file: User Server started, listening on 2003

Available commands:
- RequestProof (r): requests nearby users to send proof of user location
- SubmitLocation (s): submits location report to the server
- ObtainLocation (o <epoch>): requests from the server the location of the user on the specified epoch
- RequestMyProofs (p <epoch>,<epoch>): requests from the server the location of the user on the specified epoch
- Sleep <n> : sleeps for n milliseconds
- Epoch (e <epoch>) : Sets the user's epoch to the indicated
Epoch 0> Setting time to Epoch 0
Epoch 0> Requesting Location Proof to nearby users
Epoch 0> Setting time to Epoch 0
Epoch 0> Submitting Location
ERROR: ABORTED: ERROR: Invalid request
ERROR: ABORTED: ERROR: Invalid request
ERROR: ABORTED: ERROR: Invalid request
ERROR: ABORTED: ERROR: Invalid request
Epoch 0> Setting time to Epoch 0
Epoch 0> Obtaining Location of client3 at epoch 0
INFO: PoW needed 2356 iterations!
{"user":"client3","epoch":0,"xCoord":3,"yCoord":2,"proofers":[{"userID":"client5","digSIG":"kKeNp9IjHifdPdP3THx3QNhbwGdxREM0AmvQ+54LJOgFaqz2Y3reH55oM1v2zeX0UXMGTTCriHda54lfL5yywBPchOQX/6QcYAAY503llBbUPO07LRKKbTx6WKCCj6tgdO/+HC/tbBcrt1F7vXcsiAx0QMXQfLnRVjlc797FPajLdI1+rjJjqBYHgF1VL4dXSImk2Dj9hEEhjr/ADMA3RaQ5NaRbqg6EMRexyRGf94EOP9iWHWA19ml2PCUIJAt97hh7/zaX6if3v1mT7m0rW+eNJorEsOtUgafOjY8aH6tEgSxBhSz1xcd8pf3ZOLGFX1hbimRTe0PObP+KWoKmyccrf2JgqPm2xQxPZQQW+1uXiJt3epN7MnevSNCWjfM9ZeoepY5bGG+UYNcl2DZ8aicconjBcl6lRcSiTLAO7sv3ReXnaSfFRSxL/7abInyVJAW/cyFrMZlGV7ZiwbYKdcH4YpI45Nn2KjTHfX0JCl0jH/D0W3CrudpJ2naBmONhoWvkiAPB3m5JdiUrqZ+ZC4g0yTqJJ41j+0rcgb3Bdcq0GPdG4obF5t03vMkNn9kouGf9Ao+2LGZIhz+eQce1CzsKo7xhzIR5uKXZxniswwPeTA3tGkVF6Ll3tCRUi7kxyF9BoJrNktn8Y73HxBS8rdQlwTzcNl9zQ3W8T+ffHrE="},{"userID":"client4","digSIG":"Pnlq6iG8rgj09z7H+lJV47RjLVgHLQY4GzMRpvG+0rgYF/MH+VUWHD2eIWTa7xsrwtsNRjmx3NqoMS/v5wXMuZ/zsx0vXO572NhYbisx7k9Rt3Qcwd9HYcUjc1Km1RW7B3ggw4WV2+0SmjxjadETo8BxbNUhHmpEtxfa/kt3u/xb35KCF1MSZ1s8w9yB5ODQABymLFAxcBT00J9JtDJEqh1SV7nSI2vSDLL9/ls7tChh9mmZpVMjYIWIjU0yAyZQcMusclK8Mq/WfN9lhliYPHf+0o6WMFQn8vxoQ3RiLDz6JHsBlyQ4J5XG4Lrp16b/FVRtfB9VqFDf9FZAI96h0tqziEEo2YN+iT9lwGmQ317rBTLbYaO5dOFNwlzyVn6IFUR7eBH8SnXJHp61thzL8RtuUYnkAVH/Vjw4SsrXgEYSLHXTVH+H84oCaCcDqVl+6TcOSoaDFInE5yLNCmNdjTvavtgg61PSEK9aVQxFzQjLMJUDV2R/TWuJdw2JmrqMS62sVIY81PA2WKTMhUanss54ZW19aGsbWpOA+ffINl4AwENEJ/NhZXsh3FU2tcN6C0eBYUMDo1r1/lcZaxTXkN+WVRebwYCQkSr7HLqoaZ2iKq2cVeN78g/rq7UMl7XO6FaXAgaJQy+cZR3g6IERIygs+i8u5rr5LjAO3J1Hdbo="},{"userID":"client7","digSIG":"Qoc30byxDzF/XtGe48AJL6HEAKmxy1YEFr+8dDZHDorKCE1GloyAsQAkojnE/ot/VesVOWgepk/yaGPRTlyacUmFdOJ/+8z3Pgd/+mmxVjcX1MN4GSmdcs2dcxMSeCbMfJEffHRyfqbaSO9l1pL9NDaMjZDFpbZwFP+ZUwtmEkaNDU7dNkDG7vijLYvRwlmBga190esw6kiDzmseEuCQfuDPc1elhMXW/2OoNzh9qZsDzwuCqfgIh/UKwguxQ/1Occfe0SJcfiUrw/LnfZV4Gh6w//mKCrpMafxCNwv+yYrMsgjsC0P2HQ1ScJ/Y4bMNjL9vP7AdtJgXFe9EQMYcg0m0XcPp/lVqp4F7tBVENLfUMxWYrXvHVsiMT6m3Iwya2KWgybEYqtHDNR1AHul9Np8APlfvdFQHGnbayuZ4VAOCqpDlHOACFjOP9ozh4v/h88Lkkj62deiuw8XHUZe/2YYjUxRYn9mk1GdmRbPfaIHr5kwMKZF4etcMWdWD80RmKffFAEigLERFYrc5D0Jj7h99uLsad0riCIXtt+9YDkmawgbVAqKXOLTtfXznYxbK758Pu8aHjOfCWRW9I7Sex1qeYRS3R3hRJ1E1QPBcU4dzcXNv03yrMsTy+CXdSHKucW1i4kN/cqgyfxOaHkBGt7V9Kwa9u0Fkt443rcWdjVo="},{"userID":"client10","digSIG":"JhLkZk8MC+aBuaP+hHK0EB0+6pA3vCL4SmV8CvR1nGQVPmeDHYffaaqCSInWTihE/lHneAbcKm740ekSvaIlVlYXL6SKXFoM014EnIcUUe0YuJl8fsvAV0T4o1/PfChak5INInBvLWlFIr+pkBMBicMOjlJWjANqs6uvORXVzveAqLFw1MmZgmFugP43NziQ53HWcI6ovloOmHmJbOJl4hbnsx8i5qw+c0yn6QxWac6+cU9r+SNSP91+62NlLjaAhAp3Dbeqi9N6S81laM6UOjDFkzMB3BZXs8CEiCS3rkfHq41QRqyrc1QLUnvA8m76Pr+7JglG/5ZEG0aUYQJu7P0/m+j/GmsxPBsQ45R68MS4AeU/De7xX+6Rc4cOYnEr5ng01BoSdU876g1HU+bCxLzMK29Oi7RboHuVzXhbDtABCgwlDezV9JRPAj0thrQXT+N7r+Qv65mPrsK2G9hSfXagvArtKIV+Ag3eOV2HaxzUVwJoU9batipZbtZ9gY66S3+7Po9R2LFHw+eQpBZ9l92rAxCncfLWII95Wq6spER6yiPTAEIv2QuNqVCo7Ttg1SV3pA4FARMjradp7YkYxzotyozZCmP3jiZ3r5AQa6STjULPS0OB/Tfj6447hzvOVJx76cBLdOefp39xgQN9NxAjQSkjgxseCh14b2j2v7U="}],"writerDigSig":"W1DrmLEuI3QBX18sbsYL6S72Im61as4yfCh0r1K8Z5SlkcZRHq4azVVIogd0BBBOcDf414asadNJiMfGE5ZFIBt5QPEnvzupBeyxUKLUgPqroozU3usO8zrbpgQb+DoIyZYX8fM7VRAJX9CX6nfcMvojzD6xJnJqV53eRE7vbS8ygW5wxZfD/z5XuCWHo+Z9zmykt574io4uujOC3SvdubHqmj6c2A+iVITiIXyX5jXINrIil5HcOE9VQKoSeYZsjq+m/yiE9DPC3iclW8jeeyhPY1SMP/tAMlsZ4XgkAHSVVEAVdTf/3rRIzBo4GOABiiP1CRtgIicS6tTcLe1UVF0HGn+FDvq2hRC2d/YtOFQC7AAak2zsxxd+Lbd07p3m8US+7N2R7V9ktC0Lx+6yR25SaFUXibcJxr+iQV/tBLyVyXURjd1ZQLhnTXB4IA6qDokhvAVfKqCKycYOhhUDIDzDZ0er9p6hv+5fELTuiPWJ+ZP3vO7K5f4BJKoKo+43FNh43kj4eSObEly1Hap8aBL9SKAv3SW+vbqvukTKxxEUfX+UI3HjkYmwMTLPkvHwYYlYIut/AWgt6MwFlyFx9AqsmYOMiICn0cuVlcHGXvJtiow6pHfPQI+PW1AGfoxFehCimuP1CG6esOmXv74XmlHkb7IdDs/PnYc9QvPFqRw="}
Epoch 0> Setting time to Epoch 1
Epoch 1> Requesting Location Proof to nearby users
Epoch 1> Setting time to Epoch 1
Epoch 1> Submitting Location
Submit Location operation was successfully executed
Epoch 1> Setting time to Epoch 4
Epoch 4> Requesting Location Proof to nearby users
Epoch 4> Setting time to Epoch 4
Epoch 4> Submitting Location
Submit Location operation was successfully executed
Epoch 4> java.util.NoSuchElementException: No line found
	at java.base/java.util.Scanner.nextLine(Scanner.java:1651)
	at HDLT_user.main(HDLT_user.java:819)
